# Built In Failures Rebar Failures Rebar Crank Over End Treatment Property

Source: https://www.revitapidocs.com/2026/cf99475c-50c9-f817-406f-d32642fb0145.htm

---

| Built In Failures Rebar Failures Rebar Crank Over End Treatment Property |
| --- |

Cannot add crank to the end that already has an end treatment.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FailureDefinitionId RebarCrankOverEndTreatment { get; }
```

```
Public Shared ReadOnly Property RebarCrankOverEndTreatment As FailureDefinitionId
	Get
```

```
public:
static property FailureDefinitionId^ RebarCrankOverEndTreatment {
	FailureDefinitionId^ get ();
}
```

```
static member RebarCrankOverEndTreatment : FailureDefinitionId with get
```

#### Property Value

FailureDefinitionId See Also

#### Reference

BuiltInFailures RebarFailures Class Autodesk.Revit.DB Namespace